Revit 2017 API
Plane Properties
The Plane type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Surface.)
Normal
 Plane normal.
Origin
 Plane origin.
XVec
 Axis defining the first parametric direction of the plane.
YVec
 Axis defining the second parametric direction of the plane.
See Also
Plane Class
Autodesk.Revit.DB Namespace